In [15]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\agadi\documents\a\pythonprojects\cricket-bot\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [16]:
import pandas as pd
from io import StringIO

In [17]:
import sqlite3
cnx = sqlite3.connect(r'data/bank.sqlite')

In [18]:
transactions = StringIO("""
TransactionID,Date,AccountNumber,TransactionType,Amount,Currency,Recepient
1,2024-04-20,1234567890,Transfer,250.00,USD,Amazon
2,2024-04-22,1234567891,Withdrawal,100.00,USD,Self
3,2024-04-25,1234567892,Transfer,400.00,USD,Starbucks
4,2024-05-01,1234567890,Withdrawal,150.00,USD,Self
5,2024-05-03,1234567891,Transfer,500.00,USD,Uber
6,2024-05-10,1234567892,Withdrawal,200.00,USD,Self
7,2024-05-15,1234567890,Transfer,700.00,USD,Amazon
8,2024-05-20,1234567891,Withdrawal,300.00,USD,Self
9,2024-05-25,1234567892,Transfer,350.00,USD,Starbucks
10,2024-06-01,1234567890,Withdrawal,400.00,USD,Self
11,2024-06-05,1234567891,Transfer,450.00,USD,Amazon
12,2024-06-10,1234567892,Withdrawal,250.00,USD,Self
13,2024-06-15,1234567890,Transfer,600.00,USD,Rent
14,2024-06-20,1234567891,Withdrawal,350.00,USD,Self
15,2024-06-25,1234567892,Transfer,900.00,USD,Starbucks
16,2024-07-01,1234567890,Withdrawal,500.00,USD,Self
17,2024-07-05,1234567891,Transfer,550.00,USD,Amazon
18,2024-07-10,1234567892,Withdrawal,600.00,USD,Self
19,2024-07-15,1234567890,Transfer,750.00,USD,Uber
20,2024-07-20,1234567891,Withdrawal,700.00,USD,Self
""")
df = pd.read_csv(transactions)
df.head()

,TransactionID,Date,AccountNumber,TransactionType,Amount,Currency,Recepient
0,1,2024-04-20,1234567890,Transfer,250.0,USD,Amazon
1,2,2024-04-22,1234567891,Withdrawal,100.0,USD,Self
2,3,2024-04-25,1234567892,Transfer,400.0,USD,Starbucks
3,4,2024-05-01,1234567890,Withdrawal,150.0,USD,Self
4,5,2024-05-03,1234567891,Transfer,500.0,USD,Uber

In [19]:
df.to_sql(name='transactions', con=cnx)

20

In [20]:
accounts = StringIO("""
AccountID,AccountNumber,AccountHolderName,AccountType,OpeningDate,Balance,Currency
1,1234567890,John Doe,Checking,2022-01-15,5000.00,USD
2,1234567891,Jane Smith,Savings,2023-03-22,7500.00,USD
3,1234567892,Bob Johnson,Checking,2021-11-30,6000.00,USD
""")
df1 = pd.read_csv(accounts)
df1.head()

,AccountID,AccountNumber,AccountHolderName,AccountType,OpeningDate,Balance,Currency
0,1,1234567890,John Doe,Checking,2022-01-15,5000.0,USD
1,2,1234567891,Jane Smith,Savings,2023-03-22,7500.0,USD
2,3,1234567892,Bob Johnson,Checking,2021-11-30,6000.0,USD

In [21]:
df1.to_sql(name='accounts', con=cnx)

3

: